1 Добавление Перекрестков группировка фазы указание участия стоплиний юай
2 Панель просмотра результатов расчетов задержка там смещения в будущем все такое
5 валидация запросов возврат ошибок
3 Бэкенд, юзеры логин, мои расчеты, мои шаблоны, дефолтные установки
4 Переделать бэкенд на расчет в разных вкладках
6 блокировка кнопок в зависимости от состояния
7 рефакторинг фронтенда
8 оптимизация смещений(подумать о фазах и длительности цикла)
9 устойчивость пк см диссертацию
10 графики светофорной сигнализации
11 маршруты
12 Диаграммы время путь по маршрутам расчет времени проезда волна
